backend/solution/app/controllers/todo_controller.rb

SELECT "todos".* FROM "todos"
---
  def index
    @todo = Todo.all

INSERT INTO "todos" ("title", "deadline", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "First Title"], ["deadline", "2019-06-12"], ["created_at", "2019-06-12 04:53:08.121574"], ["updated_at", "2019-06-12 04:53:08.121574"]]
---
  def create
    @todo = Todo.new(todo_params)
    if @todo.save

UPDATE "todos" SET "done_flag" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["done_flag", "true"], ["updated_at", "2019-06-12 06:04:15.665749"], ["id", 1]]
---
  def update
    if @todo.update(done_flag: params[:done_flag])

DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 2]]
---
  def destroy
  	@todo.destroy(params[:id])

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? AND "todos"."id" = ? LIMIT ?  [["id", 6], ["id", 6], ["LIMIT", 1]]
SELECT  1 AS one FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def set_todo
    @todo = Todo.where(id: params[:id])
    unless @todo.exists?